spec/json/invalid_stripe_event.json

{
  "created": 1439944460,
  "livemode": false,
  "type": "charge.succeeded",
  "data": {
    "object": {
      "id": "ch_16bKX1Lk4JkEvTE3yT6cYfrI",
      "object": "charge",
      "created": 1439944459,
      "livemode": false,
      "paid": true,
      "status": "succeeded",
      "amount": 999,
      "currency": "usd",
      "refunded": false,
      "source": {
        "id": "card_16bKX1Lk4JkEvTE3W0DaciG4",
        "object": "card",
        "last4": "4242",
        "brand": "Visa",
        "funding": "credit",
        "exp_month": 9,
        "exp_year": 2016,
        "fingerprint": "Yz7Prz2318yyfabQ",
        "country": "US",
        "name": null,
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": "pass",
        "address_line1_check": null,
        "address_zip_check": null,
        "tokenization_method": null,
        "dynamic_last4": null,
        "metadata": {},
        "customer": "cus_6oyTxjzeMoKMpJ"
      },
      "captured": true,
      "balance_transaction": "txn_16bKX2Lk4JkEvTE3LGdscb6l",
      "failure_message": null,
      "failure_code": null,
      "amount_refunded": 0,
      "customer": "cus_6oyTxjzeMoKMpJ",
      "invoice": "in_16bKX1Lk4JkEvTE3CtehFfwg",
      "description": null,
      "dispute": null,
      "metadata": {},
      "statement_descriptor": "MyFlix Basic",
      "fraud_details": {},
      "receipt_email": null,
      "receipt_number": null,
      "shipping": null,
      "destination": null,
      "application_fee": null,
      "refunds": {
        "object": "list",
        "total_count": 0,
        "has_more": false,
        "url": "/v1/charges/ch_16bKX1Lk4JkEvTE3yT6cYfrI/refunds",
        "data": []
      }
    }
  },
  "object": "event",
  "pending_webhooks": 3,
  "request": "req_6oyTzWG4V3IQh2",
  "api_version": "2015-07-28"
}